In [116]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          781                 84
1        UAS1         Fisika                          638                 62
2        UTS2         Fisika                          651                 86
3        UAS2         Fisika                          589                 71
4        UTS1     Matematika                          576                 56
5        UAS1     Matematika                          303                 70
6        UTS2     Matematika                          586                 67
7        UAS2     Matematika                          530                 77
8        UTS1     Statistika                          270                 70
9        UAS1     Statistika                          655                 79
10       UTS2     Statistika                          505                 43
11       UAS2     Statistika                          522                 44



---



---

## Soal 1. Data Cleaning

Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil

*   Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil
*   Tipe Ujian dan Mata pelajaran apakah yang memiliki rata2 nilai terkecil?

In [117]:
#code here
df.sort_values('Rata2 Nilai Ujian', ascending=False)

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
2        UTS2         Fisika                          651                 86
0        UTS1         Fisika                          781                 84
9        UAS1     Statistika                          655                 79
7        UAS2     Matematika                          530                 77
3        UAS2         Fisika                          589                 71
5        UAS1     Matematika                          303                 70
8        UTS1     Statistika                          270                 70
6        UTS2     Matematika                          586                 67
1        UAS1         Fisika                          638                 62
4        UTS1     Matematika                          576                 56
11       UAS2     Statistika                          522                 44
10       UTS2     Statistika                          505                 43

In [118]:
df.sort_values(by='Rata2 Nilai Ujian')
#Nilai Rata2 ujian terkecil terdapat pada tipe ujian UTS2 dan Mata pelajaran statistika

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
10       UTS2     Statistika                          505                 43
11       UAS2     Statistika                          522                 44
4        UTS1     Matematika                          576                 56
1        UAS1         Fisika                          638                 62
6        UTS2     Matematika                          586                 67
5        UAS1     Matematika                          303                 70
8        UTS1     Statistika                          270                 70
3        UAS2         Fisika                          589                 71
7        UAS2     Matematika                          530                 77
9        UAS1     Statistika                          655                 79
0        UTS1         Fisika                          781                 84
2        UTS2         Fisika                          651                 86

Expected output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1iv8P-LDdN3WpTVX9qST3kL7QSNSDiOc2)



---



---

<h2>Soal 2: Data Restructuring</h2>

Jelaskan itu pivoting dan melting data

pivoting merupakan pengubahan bentuk data dengan memutar data baris menjadi kolom.
melting data (unpivoting) merupakan kebalikan dari pivoting yaitu pengubahan data dengan memutar kolom menjadi baris.



---



---

<h2>Soal 3: Reshaping Data 1</h2>

In [119]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df1 = pd.DataFrame(data)
df1

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          701                 83
1        UAS1         Fisika                          594                 82
2        UTS2         Fisika                          228                 93
3        UAS2         Fisika                          289                 63
4        UTS1     Matematika                          726                 89
5        UAS1     Matematika                          498                 58
6        UTS2     Matematika                          658                 93
7        UAS2     Matematika                          261                 56
8        UTS1     Statistika                          234                 47
9        UAS1     Statistika                          556                 93
10       UTS2     Statistika                          379                 69
11       UAS2     Statistika                          576                 79

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [120]:
#code here
pivot_df1= df1.pivot(index='Tipe Ujian', columns='Mata Pelajaran', values=['Rata2 Nilai Ujian','Rata2 Waktu Belajar (menit)']) 
print (pivot_df1)

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          82         58         93
UAS2                          63         56         79
UTS1                          83         89         47
UTS2                          93         93         69

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   594        498        556
UAS2                                   289        261        576
UTS1                                   701        726        234
UTS2                                   228        658        379

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)



---



---

<h2>Soal 4: Reshaping Data 2</h2>

In [121]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df2 = pd.DataFrame(data).set_index('Hari')
df2

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [122]:
#code here
data_baru=df2.reset_index()

melt_databaru= pd.melt(data_baru, id_vars = ['Hari'], var_name='Tempat Hiburan', value_name='Pengunjung')
print(melt_databaru)

     Hari  Tempat Hiburan  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)



---



---

<h2>Soal 5: Data Enrichment</h2>

Lakukan binning data menggunakan qcut sehingga sesuai hasil yang diharapkan

In [123]:
#code here
kategori = ['tidak lulus','remedial','lulus']

df['Keterangan kelulusan'] = pd.qcut(df['Rata2 Nilai Ujian'], q=3, labels=kategori)
df

,Tipe Ujian,Mata Pelajaran,Rata2 Waktu Belajar (menit),Rata2 Nilai Ujian,Keterangan kelulusan
0,UTS1,Fisika,781,84,lulus
1,UAS1,Fisika,638,62,tidak lulus
2,UTS2,Fisika,651,86,lulus
3,UAS2,Fisika,589,71,remedial
4,UTS1,Matematika,576,56,tidak lulus
5,UAS1,Matematika,303,70,remedial
6,UTS2,Matematika,586,67,remedial
7,UAS2,Matematika,530,77,lulus
8,UTS1,Statistika,270,70,remedial
9,UAS1,Statistika,655,79,lulus
10,UTS2,Statistika,505,43,tidak lulus
11,UAS2,Statistika,522,44,tidak lulus

Expected Output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1h2_u5_xhD1_QtPpItTj-o3lljHhnr4XS)



---



---